Ran Plan for project: `crawlinghub-sqs-prod` dir: `terraform/sqs` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_iam_policy.sqs_access will be updated in-place
~ resource "aws_iam_policy" "sqs_access" {
        id               = "arn:aws:iam::646886795421:policy/crawlinghub-sqs-access-prod"
        name             = "crawlinghub-sqs-access-prod"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                          + "arn:aws:sqs:ap-northeast-2:646886795421:prod-monitoring-sqs-crawlinghub-product-sync-dlq",
                          + "arn:aws:sqs:ap-northeast-2:646886795421:prod-monitoring-sqs-crawlinghub-product-sync",
                          + "arn:aws:sqs:ap-northeast-2:646886795421:prod-monitoring-sqs-crawlinghub-product-image-dlq",
                          + "arn:aws:sqs:ap-northeast-2:646886795421:prod-monitoring-sqs-crawlinghub-product-image",
                            "arn:aws:sqs:ap-northeast-2:646886795421:prod-monitoring-sqs-crawlinghub-eventbridge-trigger-dlq",
                            # (3 unchanged elements hidden)
                        ]
                        # (3 unchanged attributes hidden)
                    },
                    {
                        Action   = [
                            "kms:GenerateDataKey",
                            "kms:Decrypt",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:kms:ap-northeast-2:646886795421:key/c92362b0-6353-416d-af2b-e09c875bae36"
                        Sid      = "AllowKMSForSQS"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {
            "Environment" = "prod"
            "Name"        = "crawlinghub-sqs-access-prod"
            "Service"     = "crawlinghub-sqs"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_ssm_parameter.product_image_dlq_url will be created
+ resource "aws_ssm_parameter" "product_image_dlq_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "CrawlingHub product image DLQ URL"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/crawlinghub/sqs/product-image-dlq-url"
      + tags           = {
          + "Environment" = "prod"
          + "Name"        = "crawlinghub-sqs-product-image-dlq-url"
        }
      + tags_all       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-sqs-product-image-dlq-url"
          + "Project"     = "crawlinghub"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.product_image_queue_arn will be created
+ resource "aws_ssm_parameter" "product_image_queue_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "CrawlingHub product image queue ARN"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/crawlinghub/sqs/product-image-queue-arn"
      + tags           = {
          + "Environment" = "prod"
          + "Name"        = "crawlinghub-sqs-product-image-queue-arn"
        }
      + tags_all       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-sqs-product-image-queue-arn"
          + "Project"     = "crawlinghub"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.product_image_queue_url will be created
+ resource "aws_ssm_parameter" "product_image_queue_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "CrawlingHub product image queue URL"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/crawlinghub/sqs/product-image-queue-url"
      + tags           = {
          + "Environment" = "prod"
          + "Name"        = "crawlinghub-sqs-product-image-queue-url"
        }
      + tags_all       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-sqs-product-image-queue-url"
          + "Project"     = "crawlinghub"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.product_sync_dlq_url will be created
+ resource "aws_ssm_parameter" "product_sync_dlq_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "CrawlingHub product sync DLQ URL"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/crawlinghub/sqs/product-sync-dlq-url"
      + tags           = {
          + "Environment" = "prod"
          + "Name"        = "crawlinghub-sqs-product-sync-dlq-url"
        }
      + tags_all       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-sqs-product-sync-dlq-url"
          + "Project"     = "crawlinghub"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.product_sync_queue_arn will be created
+ resource "aws_ssm_parameter" "product_sync_queue_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "CrawlingHub product sync queue ARN"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/crawlinghub/sqs/product-sync-queue-arn"
      + tags           = {
          + "Environment" = "prod"
          + "Name"        = "crawlinghub-sqs-product-sync-queue-arn"
        }
      + tags_all       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-sqs-product-sync-queue-arn"
          + "Project"     = "crawlinghub"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.product_sync_queue_url will be created
+ resource "aws_ssm_parameter" "product_sync_queue_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "CrawlingHub product sync queue URL"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/crawlinghub/sqs/product-sync-queue-url"
      + tags           = {
          + "Environment" = "prod"
          + "Name"        = "crawlinghub-sqs-product-sync-queue-url"
        }
      + tags_all       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-sqs-product-sync-queue-url"
          + "Project"     = "crawlinghub"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 6 to add, 1 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p crawlinghub-sqs-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FCrawlingHub%252Fterraform%252Fsqs%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p crawlinghub-sqs-prod
  ```
Plan: 6 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```